In [1]:
# Section 6: Date, String And Mathemetical Functions
'''
After completing this section you will learn:
* How to format dates in SQL using functions
* How to use date formatting functions to work with date values represented by different data types
* Simple String functions
* Simple Mathematical functions
The section will end with some practical assignment questions

'''

''

In [11]:
# Overview of the EMPLOYEES(EMP/DEPT) Data Model
'''
* EMP/DEPT Dataset
 - EMP [ EMPNO, ename , job, mgr, hiredate, sal, comm, depno ]
 - DEPT 

drop table "Customer Age";
'''

'\n* EMP/DEPT Dataset\n - EMP [ EMPNO, ename , job, mgr, hiredate, sal, comm, depno ]\n - DEPT \n\ndrop table "Customer Age";\n'

In [13]:
# The Cast Function
'''
 * CAST(expression as datatype)

describe emp;
select hiredate, cast(hiredate as timestamp) from emp;
'''

'\n * CAST(expression as datatype)\n\ndescribe emp;\nselect hiredate, cast(hiredate as timestamp) from emp;\n'

In [14]:
# Date Values and Formatting
'''
select hiredate from emp;
select hiredate from emp where  hiredate = DATE '1981-05-01'; -- its a date liteal, format is YYYY-MM-dd
select hiredate from emp where  hiredate = '05/01/1981';  -- string literal value comare with date , orer is important
select hiredate from emp where  hiredate = '05-01-1981';
select hiredate from emp where  hiredate = 'MAY-01-1981';
select hiredate from emp where hiredate = DATE '1981/05/01'; 

-- Date Convertion Formula
-- to_date() => convert string to date
select hiredate from emp where hiredate = to_DATE('19810501', 'YYYYMMDD'); 
select hiredate from emp where hiredate = to_DATE(19810501, 'YYYYMMDD'); 
select hiredate from emp where hiredate = to_DATE('01/05/1981', 'DD/MM/YYYY'); 

alter table emp add(varchar_date varchar(20));
select * from emp;
update emp
 set varchar_date = '01/05/1981';

select * from emp where hiredate = varchar_date; -- EMPTY
select * from emp where hiredate = to_date(varchar_date, 'DD/MM/YYYY');

alter table emp drop column varchar_date;

'''

"\nselect hiredate from emp;\nselect hiredate from emp where  hiredate = DATE '1981-05-01'; -- its a date liteal, format is YYYY-MM-dd\nselect hiredate from emp where  hiredate = '05/01/1981';  -- string literal value comare with date , orer is important\nselect hiredate from emp where  hiredate = '05-01-1981';\nselect hiredate from emp where  hiredate = 'MAY-01-1981';\nselect hiredate from emp where hiredate = DATE '1981/05/01'; \n\n-- Date Convertion Formula\n-- to_date() => convert string to date\nselect hiredate from emp where hiredate = to_DATE('19810501', 'YYYYMMDD'); \nselect hiredate from emp where hiredate = to_DATE(19810501, 'YYYYMMDD'); \nselect hiredate from emp where hiredate = to_DATE('01/05/1981', 'DD/MM/YYYY'); \n\nalter table emp add(varchar_date varchar(20));\nselect * from emp;\nupdate emp\n set varchar_date = '01/05/1981';\n\nselect * from emp where hiredate = varchar_date; -- EMPTY\nselect * from emp where hiredate = to_date(varchar_date, 'DD/MM/YYYY');\n\nalter table emp drop column varchar_date;\n\n"

In [15]:
# Date Functions
'''
 - SYSDATE
 - TOCHAR()
 - DATE1 - DATE2
 - ADD_MONTHS(expression, value)


-- difference 
select hiredate, sysdate, hiredate - date '1980-01-01' from emp;
select hiredate, sysdate, hiredate - to_date('1980-01-01','YYYY-MM-DD') from emp;
select hiredate, to_char(hiredate, 'MON') from emp;
select hiredate, to_char(hiredate, 'MONTH') from emp;
select hiredate, ADD_MONTHS(hiredate, 2), ADD_MONTHS(hiredate, -2)  from emp;

'''

"\n - SYSDATE\n - TOCHAR()\n - DATE1 - DATE2\n - ADD_MONTHS(expression, value)\n\n\n-- difference \nselect hiredate, sysdate, hiredate - date '1980-01-01' from emp;\nselect hiredate, sysdate, hiredate - to_date('1980-01-01','YYYY-MM-DD') from emp;\nselect hiredate, to_char(hiredate, 'MON') from emp;\nselect hiredate, to_char(hiredate, 'MONTH') from emp;\nselect hiredate, ADD_MONTHS(hiredate, 2), ADD_MONTHS(hiredate, -2)  from emp;\n\n"

In [17]:
# String Functions
'''
 - upper()
 - lower()
 - proper()
 - LENGTH()
 - CONCAT()
 - STRING || STRING || GTRING 
 - SUBSTR()
 - REPLACE()
 - TRIM()
'''
# Ex 
'''
select * from emp;
select lower(ename), length(ename), concat(ename,job) from emp;
select lower(ename), length(ename), concat(ename, '_',job) from emp; -- invalid
select  ename||'_'||job from emp; 
select job , replace(job, 'MANAGER','MAN') from emp;
'''

"\nselect * from emp;\nselect lower(ename), length(ename), concat(ename,job) from emp;\nselect lower(ename), length(ename), concat(ename, '_',job) from emp; -- invalid\nselect  ename||'_'||job from emp; \nselect job , replace(job, 'MANAGER','MAN') from emp;\n"

In [18]:
# Mathemetical Functions
'''
 - ABS()
 - ROUND()
 - CEILING()
 - FLOOR()
 - TRUNCATE()
 - POWER()
'''

'\n - ABS()\n - ROUND()\n - CEILING()\n - FLOOR()\n - TRUNCATE()\n - POWER()\n'

In [19]:
# Useful Liks
'''
Here are some useful links that cover functions for the different Database Management Systems:

Date Formatting
Oracle:  https://docs.oracle.com/cd/B19306_01/server.102/b14200/sql_elements004.htm
MySQL: https://dev.mysql.com/doc/refman/8.0/en/date-and-time-functions.html
Microsoft SQL Server: https://docs.microsoft.com/en-us/dotnet/standard/base-types/custom-date-and-time-format-strings?redirectedfrom=MSDN


Date Functions
Oracle: https://docs.oracle.com/cd/E49933_01/server.770/es_eql/src/ceql_functions_date.html
MySQL: https://dev.mysql.com/doc/refman/8.0/en/date-and-time-functions.html
Microsoft SQL Server: https://docs.microsoft.com/en-us/sql/t-sql/functions/date-and-time-data-types-and-functions-transact-sql?view=sql-server-ver15



String Functions
Oracle: https://docs.oracle.com/middleware/1221/biee/BIVUG/GUID-BBA975C7-B2C5-4C94-A007-28775680F6A5.htm#BILUG685
MySQL: https://dev.mysql.com/doc/refman/8.0/en/string-functions.html
Microsoft SQL Server: https://docs.microsoft.com/en-us/sql/t-sql/functions/string-functions-transact-sql?view=sql-server-ver15



Mathematical Functions
Oracle: https://docs.oracle.com/middleware/12212/biee/BIVUG/GUID-DE2A646A-2DAB-4D9E-BDDB-3AA4923BF1CE.htm#BILUG684
MySQL: https://dev.mysql.com/doc/refman/8.0/en/mathematical-functions.html
Microsoft SQL Server: https://docs.microsoft.com/en-us/sql/t-sql/functions/mathematical-functions-transact-sql?view=sql-server-ver15
'''

'\nHere are some useful links that cover functions for the different Database Management Systems:\n\nDate Formatting\nOracle:  https://docs.oracle.com/cd/B19306_01/server.102/b14200/sql_elements004.htm\nMySQL: https://dev.mysql.com/doc/refman/8.0/en/date-and-time-functions.html\nMicrosoft SQL Server: https://docs.microsoft.com/en-us/dotnet/standard/base-types/custom-date-and-time-format-strings?redirectedfrom=MSDN\n\n\nDate Functions\nOracle: https://docs.oracle.com/cd/E49933_01/server.770/es_eql/src/ceql_functions_date.html\nMySQL: https://dev.mysql.com/doc/refman/8.0/en/date-and-time-functions.html\nMicrosoft SQL Server: https://docs.microsoft.com/en-us/sql/t-sql/functions/date-and-time-data-types-and-functions-transact-sql?view=sql-server-ver15\n\n\n\nString Functions\nOracle: https://docs.oracle.com/middleware/1221/biee/BIVUG/GUID-BBA975C7-B2C5-4C94-A007-28775680F6A5.htm#BILUG685\nMySQL: https://dev.mysql.com/doc/refman/8.0/en/string-functions.html\nMicrosoft SQL Server: https://docs.microsoft.com/en-us/sql/t-sql/functions/string-functions-transact-sql?view=sql-server-ver15\n\n\n\nMathematical Functions\nOracle: https://docs.oracle.com/middleware/12212/biee/BIVUG/GUID-DE2A646A-2DAB-4D9E-BDDB-3AA4923BF1CE.htm#BILUG684\nMySQL: https://dev.mysql.com/doc/refman/8.0/en/mathematical-functions.html\nMicrosoft SQL Server: https://docs.microsoft.com/en-us/sql/t-sql/functions/mathematical-functions-transact-sql?view=sql-server-ver15\n'

In [10]:
# Assignment Questions
'''
 - TMRW 
'''